Revit 2027 API
HandRailPosition Enumeration
 The position of the hand rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HandRailPosition
Public Enumeration HandRailPosition
public enum class HandRailPosition
type HandRailPosition
Members
Member name | Value | Description
Left | 1 |  The hand rail is on the left side of railing.
LeftAndRight | 3 |  The handrail is on both sides of the railing.
None | 0 |  No hand rail
Right | 2 |  The hand rail is on the right side of railing.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace